# Project 1: Build Decision Tree(DV-"Survived",IDV-"Age,Gender and Fare") and Prediction

In [1]:
import pandas as pd
import numpy as np
from sklearn import tree
from sklearn import preprocessing
from warnings import filterwarnings
filterwarnings('ignore')

In [2]:
titanic_train=pd.read_csv('train.csv')

In [3]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_train['Age'].mean()

32.69985376827896

In [5]:
# Adding mean value 32 to the null values in column Age
new_age_var=np.where(titanic_train['Age'].isnull(),32,titanic_train['Age'])

In [6]:
titanic_train['Age']=new_age_var

In [7]:
# Conversion of Categorical variable
label_encoder=preprocessing.LabelEncoder()

In [8]:
encoded_sex=label_encoder.fit_transform(titanic_train['Sex'])

In [9]:
# Storing the IDV in Dataframe
predictors=pd.DataFrame([titanic_train['Age'],encoded_sex,titanic_train['Fare']]).T

In [10]:
# Building the model (Here depth=6 means we have 2 outputs survived 1 and survived 0 and we have 3 IDV i.e 2*3=6)
tree_model=tree.DecisionTreeClassifier(max_depth=6)

In [11]:
# Fitting the model
tree_model.fit(X=predictors,y=titanic_train['Survived'])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=6, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [12]:
# Creating the Decision Tree
with open("Dtree.dot","w") as f:
    f=tree.export_graphviz(tree_model,feature_names=["Age","Sex","Fare"],out_file=f);

In [13]:
# Checking the model score/accuracy for prediction
tree_model.score(X=predictors,y=titanic_train['Survived'])

0.8301462317210349

The Model is 83% Accurate for prediction

In [14]:
# Prediction
titanic_test=pd.read_csv('test.csv')

In [15]:
titanic_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [16]:
titanic_test['Age'].mean()

33.23741007194245

In [17]:
# Adding mean value 33 to the null values in column Age
new_age_var=np.where(titanic_test['Age'].isnull(),33,titanic_test['Age'])

In [18]:
titanic_test['Age']=new_age_var

In [19]:
# Conversion of Categorical variable
encoded_sex_test=preprocessing.LabelEncoder().fit_transform(titanic_test['Sex'])

In [20]:
# Storing the IDV in Dataframe
test_features=pd.DataFrame([titanic_test['Age'],encoded_sex_test,titanic_test['Fare']]).T

In [21]:
# Predicting the output which is Survived values
test_pred=tree_model.predict(X=test_features)

In [22]:
# Creating a dataframe of predicted output
predicted_op=pd.DataFrame({"PassengerId":titanic_test['PassengerId'],"Survived":test_pred})

In [23]:
# Converting the output to an csv file
predicted_op.to_csv("Output.csv",index=False)

In [24]:
# Loading the output file
output=pd.read_csv('Output.csv')
output.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

# Rules of the Decision Tree
1) One Female passenger with Fare greater than 48.2 and Age less than 8 years did not survived.

2) Eight Male passengers with Age less than 6.5 years and Fare less than 20.82 survived.

3) Four Male passengers with Age greater than 6.5 years and Fare less than 26.46 survived.

4) Two Male passengers with Age greater than 6.5 years and Fare greater than 387.66 survived.

5) Four Female passengers with Fare less than 28.85 did not survived.

6) Two Male passengers with Age less than 6.5 years and Fare greater than 64.37 survived.

7) Two Female passengers with Fare greater than 44.24 did not survived.

8) Twenty Two Female passengers with Fare less than 69.42 and Age greater than 8 years survived.

9) Three Female passengers with Fare greater than 69.42 and Age greater than 8 years did not survived.

10) Fourty Five Female passengers with Fare less than 70.27 and Age greater than 25.5 years survived.

11) Three Male passengers with Age greater than 3.5 years and Fare less than than 64.37 did not survived.

12) Two Male passengers with Age greater than 6.5 years but less than 13.5 years and Fare less than than 17.34 survived.